* Start the scenario

#+begin_src sh :results none
docker compose up -d
#+end_src

Wait until the =STATE= of all the following services is =running=.

#+begin_src sh
docker compose ps --format "table {{.Name}}\t{{.State}}"
#+end_src

#+RESULTS:
#+begin_example
NAME                      STATE
consumer-connector-db     running
consumer-controlplane     running
consumer-dataplane        running
consumer-http-server      running
consumer-identityhub      running
consumer-identityhub-db   running
consumer-sts              running
consumer-ui2connector     running
consumer-vault            running
dataspace-issuer          running
provider-connector-db     running
provider-controlplane     running
provider-dataplane        running
provider-identityhub      running
provider-identityhub-db   running
provider-sts              running
provider-ui2connector     running
provider-vault            running
#+end_example

Now run the ~seed.sh~ script.
This script registers the provider with the consumer's identity hub and the consumer with the provider's identity hub by sending their identity and endpoint info, enabling secure communication between them.

#+begin_src sh
./seed.sh
#+end_src

#+RESULTS:
: Create consumer participant
:
: {"clientId":"did:web:consumer-identityhub%3A7083","apiKey":"ZGlkOndlYjpjb25zdW1lci1pZGVudGl0eWh1YiUzQTcwODM=.g/vjrQ2KOX9w/zRbjipH7Y7tLwDCT5AJcWTOC1CzrgCJNq/9lxLVgtepl18u9sqApj5j++S8oEQzvwoVnyv/tQ==","clientSecret":"7SKLFxucb0NtDRVi"}
: 
: Create provider participant
:
: {"clientId":"did:web:provider-identityhub%3A7093","apiKey":"ZGlkOndlYjpwcm92aWRlci1pZGVudGl0eWh1YiUzQTcwOTM=./eUTs23ICc/Juv8mqBhTTIqSjKoDKBOfMXOjWhThurZ60fKUZHI3F5nABwuJ001zK5OQAxA/24fU21DxZl/SXg==","clientSecret":"npbTMB0hsjOMM0uG"}

To use the connectors, you must first provide a password (for this scenario the password is =password=).
Do it for the [[http://localhost:3000/dashboard/myconnector][provider connector]] and the [[http://localhost:3001/dashboard/myconnector][consumer connector]].

